/* Shared */
"common.settings" = "Настройки";
"common.cancel" = "Отмена";
"common.done" = "Готово";
"common.open" = "Открыть";
"common.undo" = "Вернуть";
"common.all" = "Все";
"common.none" = "Ничего";
"common.dryRun" = "Симуляция";
"common.revealInFinder" = "Показать в Finder";

/* Menu bar */
"menubar.percentFree" = "%d %% свободно";
"menubar.toClean" = "%1$@ · %2$@ к очистке";

/* Panel header and scan */
"panel.badge.lowDisk" = "МАЛО МЕСТА";
"panel.scan.scanning" = "Сканирование…";
"panel.scan.rescan" = "Сканировать снова";
"panel.scan.start" = "Сканировать диск";
"panel.scan.starting" = "Запуск…";
"panel.scan.progress" = "%1$d/%2$d · %3$@";
"panel.scan.lastScan" = "Последнее сканирование: %@";
"panel.error.dismiss" = "Скрыть ошибку";

/* Panel footer */
"panel.footer.deletionLog" = "Журнал удалений";
"panel.footer.quit" = "Выйти";
"panel.footer.madeBy" = "автор";
"panel.footer.openSite" = "Открыть toprak.sh";

/* All-clean card */
"panel.allClean.title" = "Всё чисто";
"panel.allClean.body" = "Сейчас освобождать нечего. Dusty продолжает следить в фоне.";
"panel.allClean.bodyChecked" = "Освобождать нечего (проверено %@). Dusty продолжает следить в фоне.";

/* Free space header */
"header.free" = "СВОБОДНО";
"header.used" = "ЗАНЯТО";
"header.total" = "ВСЕГО";
"header.a11y.label" = "Место на диске";
"header.a11y.value" = "%1$@ свободно из %2$@, занято %3$d процентов";

/* Reclaimable summary */
"reclaim.title" = "МОЖНО ОСВОБОДИТЬ";
"reclaim.a11y.label" = "Место, которое можно освободить";
"reclaim.cleanSafe" = "Безопасная очистка · %@";
"reclaim.nothingToClean" = "Безопасно чистить нечего";

/* Insights */
"insights.title" = "Наблюдения";
"insights.forecast" = "%1$@ до заполнения диска при текущем темпе (%2$@ в день).";
"insights.horizon.lessThanDay" = "Меньше суток";

/* Cleanup level sections */
"level.clean" = "Очистить";
"level.notScanned" = "Ещё не сканировалось. Запустите сканирование, чтобы увидеть элементы.";
"level.a11y.label" = "Уровень очистки: %@";
"level.a11y.expanded" = "развёрнуто";
"level.a11y.collapsed" = "свёрнуто";
"level.a11y.hint" = "Показывает все пути, найденные на этом уровне";
"level.a11y.cleanLabel" = "Очистить элементы уровня %@";
"level.a11y.selected" = "выбрано %@";
"level.a11y.nothingSelected" = "ничего не выбрано";

/* Target rows */
"target.skippedWhileOpen" = "Пропускается, пока %@ открыт";
"target.hideItems" = "Скрыть элементы";
"path.untouched" = "%1$@ · не трогали %2$@";

/* Confirmation */
"confirm.title" = "Подтвердите очистку";
"confirm.title.dryRun" = "Предпросмотр очистки";
"confirm.skippingApps" = "Кэш %@ пропускается, приложение открыто";
"confirm.dryRunNote" = "Симуляция: ничего не будет удалено";
"confirm.undoNote" = "Несколько секунд можно вернуть обратно";
"confirm.trashNote" = "Элементы останутся в корзине, пока вы её не очистите";
"confirm.action.delete" = "Удалить";
"confirm.action.dryRun" = "Запустить симуляцию";

/* Result banner */
"result.title.trashed" = "Перемещено в корзину";
"result.title.undoable" = "Очищено, можно вернуть";
"result.title.reclaimed" = "Очистка завершена";
"result.moved" = "перемещено";
"result.cleaned" = "очищено";
"result.body.trashed" = "Очистите корзину, чтобы освободить это место.";
"result.body.undoable" = "Вернуть можно ещё несколько секунд.";
"result.skippedLine" = "%1$@: %2$@";

/* Full Disk Access */
"fda.title" = "Рекомендуется полный доступ к диску";
"fda.body" = "Выдайте доступ в Системных настройках, чтобы сканировать системные журналы и защищённые кэши.";

/* Errors */
"error.noSelection" = "Выберите хотя бы один элемент для очистки.";
"error.quitApps" = "Закройте %@, чтобы очистить их кэши.";
"error.cleanInProgress" = "Очистка уже идёт. Попробуйте через мгновение.";
"error.cleanupFailed" = "Очистка не удалась: проверьте права доступа или попробуйте снова.";
"error.restorePartial" = "Восстановлено %1$d из %2$d. Часть вернуть не удалось (исходное место могло быть занято).";

/* Welcome */
"welcome.title" = "Добро пожаловать в Dusty";
"welcome.subtitle" = "Очистка диска, которая показывает свою работу.";
"welcome.row1.title" = "Показывает свою работу";
"welcome.row1.text" = "Сканирование перечисляет каждый путь и его размер до того, как что-то произойдёт. Сканирование никогда не удаляет.";
"welcome.row2.title" = "Только белый список";
"welcome.row2.text" = "Dusty может удалять лишь из фиксированного реестра кэшей и мусора. До «Документов», «Фото» и «Почты» он не дотянется по устройству программы.";
"welcome.row3.title" = "Возврат и подтверждение";
"welcome.row3.text" = "Очистка проходит через корзину с окном возврата, а каждое удаление записывается в журнал, который можно открыть.";
"welcome.scan" = "Первое безопасное сканирование";
"welcome.scan.hint" = "Ищет место, которое можно освободить. Ничего не удаляется.";
"welcome.skip" = "Сначала осмотрюсь";

/* Settings */
"settings.section.general" = "Основные";
"settings.launchAtLogin" = "Запускать при входе";
"settings.menuBarPercentage" = "Показывать свободное место в процентах";
"settings.menuBarReclaimable" = "Показывать освобождаемое место в строке меню";

"settings.section.language" = "Язык";
"settings.language" = "Язык панели";
"settings.language.system" = "Как в системе";
"settings.language.restartNote" = "Для смены языка Dusty нужно перезапустить.";
"settings.language.restart" = "Перезапустить Dusty";

"settings.section.refresh" = "Обновление";
"settings.refreshInterval" = "Интервал в строке меню: %d с";

"settings.section.autoScan" = "Автосканирование";
"settings.autoScanEnabled" = "Сканировать в фоне";
"settings.autoScanCaption" = "Незаметно держит цифру в строке меню свежей. Само по себе ничего не удаляет.";

"settings.section.autoClean" = "Автоочистка";
"settings.autoCleanEnabled" = "Чистить безопасные элементы по расписанию";
"settings.autoCleanFrequency" = "Частота";
"settings.frequency.daily" = "Каждый день";
"settings.frequency.weekly" = "Каждую неделю";
"settings.frequency.biweekly" = "Раз в две недели";
"settings.autoCleanLowDisk" = "Чистить и когда свободного места мало";
"settings.autoCleanThreshold" = "Ниже %d ГБ свободно";
"settings.autoCleanDeveloper" = "Включить кэши разработки";
"settings.autoCleanDryRunNote" = "Выключено, пока симуляция стоит по умолчанию: без присмотра ничего не удаляется.";
"settings.autoCleanScope.safe" = "Только кэши безопасного уровня";
"settings.autoCleanScope.developer" = "Безопасные кэши и кэши разработки (DerivedData, менеджеры пакетов)";
"settings.autoCleanCaption" = "%@. Открытые приложения пропускаются, уведомление сообщает, сколько освободилось, и каждый путь попадает в журнал удалений.";

"settings.section.stats" = "Статистика";
"settings.stats.lifetime" = "Освобождено за всё время";
"settings.stats.cleans" = "Очисток";
"settings.stats.since" = "С";
"settings.stats.recent" = "Недавние очистки";
"settings.stats.level" = "Уровень %d";

"settings.section.updates" = "Обновления";
"settings.updates.auto" = "Проверять обновления автоматически";
"settings.updates.autoInstall" = "Скачивать и устанавливать автоматически";
"settings.updates.checkNow" = "Проверить обновления";

"settings.section.cleanupDefaults" = "Параметры очистки";
"settings.dryRunDefault" = "Симуляция по умолчанию";
"settings.moveToTrash" = "Оставлять элементы уровней «Разработка» и «Глубокий» в корзине";

"settings.section.safety" = "Безопасность";
"settings.safety.body" = "Dusty придерживается строгого белого списка: удалить можно только пути из CleanupTargetRegistry, и никогда через символьную ссылку. Без sudo, без путей под защитой SIP. Единственная системная папка, до которой он дотягивается, /Library/Logs/DiagnosticReports, подключается вручную и фильтруется по возрасту файлов.";
"settings.safety.logPath" = "Журнал удалений: ~/Library/Application Support/Dusty/";

/* Notifications */
"notification.action.cleanSafe" = "Безопасная очистка";
"notification.lowDisk.title" = "Мало места на диске";
"notification.lowDisk.body" = "Доступно %@. Освободите место безопасной очисткой.";
"notification.autoClean.title" = "Автоочистка завершена";
"notification.autoClean.body" = "Dusty освободил %@ кэш-мусора. Каждый путь есть в журнале удалений.";
"notification.autoCleanLowDisk.title" = "Места на диске оставалось мало";
"notification.autoCleanLowDisk.body" = "Dusty освободил %@ автоматически. Каждый путь есть в журнале удалений.";

/* Relative time */
"time.justNow" = "только что";

/* Shortcuts actions */
"intent.cleanSafe.title" = "Очистить безопасные элементы";
"intent.cleanSafe.shortTitle" = "Безопасная очистка";
"intent.cleanSafe.description" = "Удаляет безопасные кэши и журналы, найденные Dusty, ровно как кнопка безопасной очистки. Цели с открытым приложением пропускаются, а каждый удалённый путь записывается в журнал удалений.";
"intent.cleanSafe.busy" = "Dusty уже чистит. Попробуйте через мгновение.";
"intent.cleanSafe.scanFailed" = "Сканирование не удалось, ничего не очищено.";
"intent.cleanSafe.nothing" = "Сейчас безопасно чистить нечего.";
"intent.cleanSafe.nothingSkipped" = "Сейчас безопасно чистить нечего. %@ был открыт, поэтому его кэш пропущен.";
"intent.reclaimable.title" = "Узнать освобождаемое место";
"intent.reclaimable.shortTitle" = "Освобождаемое место";
"intent.reclaimable.description" = "Сканирует все три уровня очистки и возвращает, сколько места мог бы освободить Dusty. Только чтение: ничего не удаляет.";
"intent.reclaimable.result" = "%1$@ можно освободить (из них %2$@ безопасно чистить автоматически).";
